# PartType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalFitting..::..PartType Property
MechanicalFitting Class See Also
---
The part type of the mechanical fitting.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PartType PartType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PartType As PartType
	Get
```

Visual C++
---
```text
public:
property PartType PartType {
	PartType get ();
}
```

# See Also
MechanicalFitting Class
Autodesk.Revit.DB.Mechanical Namespace